In [259]:
import pandas as pd

In [260]:
monthly = pd.read_csv('monthly_sales.csv')

In [269]:
hamburger = [i for i in monthly.columns if 'HM' in i]
hamburger = monthly[hamburger+['Month, Year']]
hamburger = hamburger.iloc[31:36]

In [270]:
hamburger.index = hamburger['Month, Year']
hamburger = hamburger.drop(columns='Month, Year')

In [281]:
hamburger

               HM-NE    HM-SW    HM-NW    HM-SE     HM-C
Month, Year
Aug-18       1654831  1625106  1662321  1574144  1543848
Sep-18       1606160  1642152  1618403  1536130  1520076
Oct-18       1380063  1351220  1351293  1334204  1364454
Nov-18       1551486  1524624  1440957  1417422  1451913
Dec-18       1446801  1419772  1343743  1383670  1360520

In [212]:
location = monthly.drop(columns='Month, Year')
location = location.sum().to_frame().reset_index().rename(columns={0:'USD','index':'location'})

In [213]:
location['Food']=location['location'].apply(lambda x: x.split('-')[0])
location['Location']=location['location'].apply(lambda x: x.split('-')[1])

In [214]:
location = location.drop(columns='location')

In [215]:
location = location.pivot_table('USD','Location','Food')

In [216]:
location

Food            CF        FF        HM
Location
C         25724566  15540968  61582375
NE        27233220  16345942  65362334
NW        26341429  15821178  63572000
SE        26039450  15614539  62328614
SW        26815953  16104137  64421707

In [217]:
HM = monthly[[i for i in monthly.columns if 'HM' in i]].sum(axis=1)
CF = monthly[[i for i in monthly.columns if 'CF' in i]].sum(axis=1)
FF = monthly[[i for i in monthly.columns if 'FF' in i]].sum(axis=1)

In [218]:
food_date = pd.DataFrame({'HM':HM,'CF':CF,'FF':FF})
food_date.index = monthly['Month, Year']

In [219]:
NE = monthly[[i for i in monthly.columns if 'NE' in i]].sum(axis=1)
SW = monthly[[i for i in monthly.columns if 'SW' in i]].sum(axis=1)
NW = monthly[[i for i in monthly.columns if 'NW' in i]].sum(axis=1)
SE = monthly[[i for i in monthly.columns if 'SE' in i]].sum(axis=1)
C = monthly[[i for i in monthly.columns if '-C' in i]].sum(axis=1)

In [220]:
region_date = pd.DataFrame({'NE':NE,'SW':SW,'NW':NW,'SE':SE,'C':C})
region_date.index=monthly['Month, Year']

In [221]:
daily = pd.read_csv('daily_sales.csv').drop(columns='Day')
daily = daily.rename(columns={'Unnamed: 0':'Day'})

In [222]:
week = daily.groupby('Day').mean()

In [223]:
NE_week = week[[i for i in week.columns if 'NE' in i]].sum(axis=1)
SW_week = week[[i for i in week.columns if 'SW' in i]].sum(axis=1)
NW_week = week[[i for i in week.columns if 'NW' in i]].sum(axis=1)
SE_week = week[[i for i in week.columns if 'SE' in i]].sum(axis=1)
C_week = week[[i for i in week.columns if '-C' in i]].sum(axis=1)

In [224]:
region_week = pd.DataFrame({'NE':NE_week,'SW':SW_week,'NW':NW_week,'SE':SE_week,'C':C_week})
region_week.index=week.index

In [225]:
region_week['Day_index'] = pd.Series([5, 1, 6, 0,4,2,3],index=region_week.index)
region_week = region_week.sort_values(by='Day_index')

In [249]:
region_week.sum(axis=1)

Day
Sunday       296574.40
Monday       303164.75
Tuesday      300025.25
Wednesday    303962.50
Thursday     303733.75
Friday       310592.00
Saturday     294339.40
dtype: float64